{
  "Road": {
    "image": "road.png",
    "description": "Endless horizons beckon from either direction of this seemingly abandoned road. Sunlight dances on the asphalt, hinting at a time when cars frequented here. Now, only the gentle whisper of wind breaks the stillness.",
    "exits": {
      "west": "Driveway"
    }
  },
  "Driveway": {
    "image": "driveway.png",
    "description": "A quaint driveway, bordered by wildflowers, leads up to an inviting residence. The pebbled path crunches beneath your feet, a lone mailbox standing sentinel at the entrance.",
    "exits": {
      "east": "Road",
      "west": "Hall"
    }
  },
  "Hall": {
    "image": "hall.png",
    "description": "Elegant wooden flooring reflects soft light, creating a welcoming ambiance in this spacious entrance hall. Subtle artwork graces the walls, telling stories of a home filled with memories.",
    "exits": {
      "north": "Kitchen",
      "south": "Living Room",
      "east": "Driveway",
      "west": "Upstairs Landing"
    }
  },
  "Living Room": {
    "image": "living_room.png",
    "description": "Warmth emanates from this room. Plush couches beckon, positioned thoughtfully around an old yet charming fireplace. The walls adorned with candid moments captured in frames.",
    "exits": {
      "north": "Hall",
      "west": "Garden"
    }
  },
  "Upstairs Landing": {
    "image": "upstairs_landing.png",
    "description": "The landing offers a peaceful overlook to the hall below. Soft carpet cushions each step, with doors leading off to various chambers of sanctuary and rest.",
    "exits": {
      "north": "Guest Bedroom",
      "east": "Kids' Bedroom",
      "south": "Master Bedroom",
      "west": "Hall"
    }
  },
  "Guest Bedroom": {
    "image": "guest_bedroom.png",
    "description": "Hints of lavender fill the air in this serene guest space. Gentle patterns on the walls soothe the eyes, while the bed promises deep slumber.",
    "exits": {
      "south": "Upstairs Landing"
    }
  },
  "Master Bedroom": {
    "image": "master_bedroom.png",
    "description": "A luxurious haven. The canopy bed rests beneath a softly glowing chandelier, with delicate drapes flowing like rivers. Here, time seems to stand still.",
    "exits": {
      "north": "Upstairs Landing"
    }
  },
  "Kids' Bedroom": {
    "image": "kids_room.png",
    "description": "Vibrant colors burst from every corner, painting a canvas of childhood wonder. This room hums with dreams of faraway adventures and tales of yesteryears.",
    "exits": {
      "west": "Upstairs Landing"
    }
  },
  "Kitchen": {
    "image": "kitchen.png",
    "description": "A symphony of culinary magic, the kitchen boasts wooden countertops aged by time. The aroma of baked goods once lingered, now waiting for new memories.",
    "exits": {
      "south": "Hall",
      "east": "Study",
      "west": "Garden"
    }
  },
  "Study": {
    "image": "study.png",
    "description": "Silent and profound, the study is an alcove of knowledge. Bookshelves tower, holding volumes of wisdom, while the desk awaits tales yet to be written.",
    "exits": {
      "west": "Kitchen"
    }
  },
  "Patio": {
    "image": "patio.png",
    "description": "The patio extends a tranquil outdoor embrace, with soft lanterns casting ambient glows. Perfect for evening reflections under the canopy of stars.",
    "exits": {
      "east": "Kitchen",
      "south": "Garden"
    }
  },
  "Garden": {
    "image": "garden.png",
    "description": "Nature's tapestry unfurls in this blossoming garden. Birds serenade amidst flowers that sway in gentle breezes, weaving a tale of time and tenderness.",
    "exits": {
      "north": "Patio",
      "east": "Living Room",
      "south": "Garage"
    }
  },
  "Garage": {
    "image": "garage.png",
    "description": "A cavern of ingenuity. Tools line the walls, standing testament to countless projects crafted. The scent of oil and timber fills the air.",
    "exits": {
      "north": "Garden",
      "south": "Home Office"
    }
  },
  "Home Office": {
    "image": "home_office.png",
    "description": "Creativity meets solitude in this bespoke home office. Echoes of ideas birthed, this space inspires productivity amidst its cozy confines.",
    "exits": {
      "north": "Garage"
    }
  }
}
